In [10]:
import pandas as pd

# 3.1 Creating a Data Frame

dataFrame = pd.DataFrame()

dataFrame["Name"] = ["Roman", "Timur", "Oleg"]
dataFrame["Age"] = [23, 24 ,23]
dataFrame["Driver"] = [True, False, None]
dataFrame.head(4)

newPerson = pd.Series(["Molly", 40, True], index=["Name", "Age", "Driver"])
dataFrame.append(newPerson, ignore_index=True)

    Name  Age Driver
0  Roman   23   True
1  Timur   24  False
2   Oleg   23   None
3  Molly   40   True

In [19]:
# 3.2 Describing the Data

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)
# Show two rows
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [23]:
# 3.3 Navigating DataFrames

dataframe.iloc[0]
dataframe.iloc[0:2]
# Set index
dataframe = dataframe.set_index(dataframe['Name'])
# Show row
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [36]:

# 3.4 Selecting Rows Based on Conditionals

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)

dataframe[(dataframe["Sex"] == "female") & (dataframe["Age"] > 54)].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
28,"Bonnell, Miss Elizabeth",1st,58.0,female,1,1
37,"Brown, Mrs John Murray (Caroline Lane Lamson)",1st,59.0,female,1,1
38,"Bucknell, Mrs William Robert (Emma Eliza Ward)",1st,60.0,female,1,1

In [40]:
# 3.5 Replacing Values

dataframe["Sex"] = dataframe['Sex'].replace(["female", "male"], ["Woman", "Man"]).head(5)

dataframe.replace(1, "One").head(2)

                           Name PClass Age    Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29  Woman      One     One
1   Allison, Miss Helen Loraine    1st   2  Woman        0     One

In [46]:
# 3.6 Renaming Columns

url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
# Load data
dataframe = pd.read_csv(url)

dataframe.rename(columns={
    "PClass" : "Passenger class",
    "Sex" : "Gender"
})

,Name,Passenger class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,male,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,male,0,0
1310,"Zenni, Mr Philip",3rd,22.00,male,0,0
1311,"Lievens, Mr Rene",3rd,24.00,male,0,0
1312,"Zimmerman, Leo",3rd,29.00,male,0,0

In [47]:
# 3.7 Finding the Minimum, Maximum, Sum, Average, and Count

dataframe = pd.read_csv(url)
# Calculate statistics
print('Maximum:', dataframe['Age'].max())
print('Minimum:', dataframe['Age'].min())
print('Mean:', dataframe['Age'].mean())
print('Sum:', dataframe['Age'].sum())
print('Count:', dataframe['Age'].count())

Maximum: 71.0
Minimum: 0.17
Mean: 30.397989417989418
Sum: 22980.88
Count: 756

In [54]:
print(dataframe["Sex"].value_counts())
# 3.8 Finding Unique Values
print(dataframe["Sex"].nunique())
dataframe["Sex"].unique()

male      851
female    462
Name: Sex, dtype: int64
2

array(['female', 'male'], dtype=object)

In [60]:
import numpy as np
# 3.9 Handling Missing Values

dataframe[dataframe["Age"].isnull()].head()
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)
dataframe

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,NaN,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,NaN,1,0
...,...,...,...,...,...,...
1308,"Zakarian, Mr Artun",3rd,27.00,NaN,0,0
1309,"Zakarian, Mr Maprieder",3rd,26.00,NaN,0,0
1310,"Zenni, Mr Philip",3rd,22.00,NaN,0,0
1311,"Lievens, Mr Rene",3rd,24.00,NaN,0,0
1312,"Zimmerman, Leo",3rd,29.00,NaN,0,0

In [62]:
# 3.10 Deleting a Column

dataframe = pd.read_csv(url)
# Delete column
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [63]:
#3.11 Deleting a Row

dataframe = pd.read_csv(url)
# Delete rows, show first two rows of output
dataframe[dataframe['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [69]:
# 3.12 Dropping Duplicate Rows

dataframe.drop_duplicates().head(2)
dataframe.drop_duplicates(subset=['Sex'], keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [77]:
# 3.13 Grouping Rows by Values

dataframe = pd.read_csv(url)
# Group rows by the values of the column 'Sex', calculate mean
# of each group
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [78]:
# 3.14 Grouping Rows by Time

# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
# Create DataFrame
dataframe = pd.DataFrame(index=time_index)
# Create column of random values
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86084
2017-06-18        99739
2017-06-25       100786
2017-07-02       101115
2017-07-09       101598
2017-07-16        10407

In [80]:
# 3.15 Looping Over a Column

dataframe = pd.read_csv(url)
# Print first two names uppercased
for name in dataframe['Name'][0:2]:
    print(name.upper())
[name.upper() for name in dataframe['Name'][0:2]]

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

In [81]:
# 3.16 Applying a Function Over All Elements in a Column

def uppercase(x):
    return x.upper()

dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

In [82]:
# 3.17 Applying a Function to Groups

dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

In [83]:
# 3.18 Concatenating DataFrames

# Create DataFrame
data_a = {'id': ['1', '2', '3'],
'first': ['Alex', 'Amy', 'Allen'],
'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])
# Create DataFrame
data_b = {'id': ['4', '5', '6'],
'first': ['Billy', 'Brian', 'Bran'],
'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])
# Concatenate DataFrames by rows
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [84]:

# 3.19 Merging DataFrames

employee_data = {'employee_id': ['1', '2', '3', '4'],
'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
'name'])
# Create DataFrame
sales_data = {'employee_id': ['3', '4', '5', '6'],
'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
'total_sales'])
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [85]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [86]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [87]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512
2           5         NaN         2345
3           6         NaN         1455